app/Livewire/EtablissementIndex.php

select * from `drens` where `drens`.`code_dren` in (12, 21, 22, 31, 33, 40, 41, 49)
select `code_dren`, `nom_dren` from `drens` order by `code_dren` asc
---
    public function render()
    {


        return view('livewire.etablissement-index',[
            'etablissements'=> ecole::with('ecole_dren')->where($this->orderField, 'LIKE', '%'.$this->search.'%')
            ->orderBy($this->orderField, $this->orderDirection)
            ->paginate(10),

            'codeDren'=>  dren::select('code_dren','nom_dren')
            ->orderBy('code_dren', 'ASC')
            ->get()
        ]);