app/Livewire/FicheIndex.php

    public function storeFiche(){
        $validate = $this->validate([
            'nom'=>'required|min:3',
            'fiche_nom'=>'required|file|mimes:pdf|max:4000',
            'classe'=>'required|min:1',
            'ecole_id'=>'required|min:1',
            'dren_id'=>'required|min:1',
            'annee'=>'required|min:4',
        ]);
        if($this->fiche_nom!==null ){
            $extensiValide = array("PDF","pdf");
            $fichiers = $this->fiche_nom->store('fiche_orientation', 'public');
            $this->fiche_nom= basename($fichiers);
            $validate['fiche_nom'] = $this->fiche_nom;

            if(in_array((pathinfo($this->fiche_nom, PATHINFO_EXTENSION)),$extensiValide)){
                    fiche::create($validate);
---
insert into `fiches` (`nom`, `fiche_nom`, `classe`, `ecole_id`, `dren_id`, `annee`, `updated_at`, `created_at`) values ('fiche ', 'A8VoHHbiPe82GqIrIcwyYs7tR8doO53tLFOWHzjd.pdf', '6eme', '4', '2', '2019', '2023-10-10 14:02:13', '2023-10-10 14:02:13')

    public function render()
    {
        return view('livewire.fiche-index',[
            'fiche'=> fiche::with('fiche_ecole')->with('fiche_dren')->where($this->orderField, 'LIKE', '%'.$this->search.'%')->paginate(10),

            'ecole'=>ecole::select('id','NOMCOMPLs')->get(),
            'codeDren'=>  dren::select('id','code_dren','nom_dren')
            ->orderBy('code_dren', 'ASC')
            ->get()
        ]);
---
select * from `drens` where `drens`.`id` in (11, 13, 40)
select * from `ecoles` where `ecoles`.`id` in (2, 5, 3460)
select count(*) as aggregate from `fiches` where `nom` LIKE '%%'
select `id`, `NOMCOMPLs` from `ecoles`
select `code_dren`, `nom_dren` from `drens` order by `code_dren` asc
select `id`, `code_dren`, `nom_dren` from `drens` order by `code_dren` asc