app/Livewire/StudentIndex.php

select * from `ecoles` where `ecoles`.`id` = 3 limit 1
---
    public function studentInfo($id){
        $this->eleveInfo = eleve::with('eleve_ecole')->where('eleves.id',$id)->get();