app/Livewire/StudentIndex.php

select * from `eleves` where `eleves`.`id` = 20
select * from `drens` where `code_dren` = 33
select * from `drens` where `code_dren` = 31
select * from `ecoles` where `ecoles`.`id` in (34)
---
    public function studentInfo($id){
        $this->eleveInfo = eleve::with('eleve_ecole_O')->where('eleves.id',$id)->get();
        $dren_O = dren::where('code_dren',$this->eleveInfo[0]['eleve_ecole_O']->CODE_DREN)->get();
        $this->drenOrigine=$dren_O[0]->nom_dren;
        $dren_A = dren::where('code_dren',$this->eleveInfo[0]['eleve_ecole_A']->CODE_DREN)->get();
        $this->drenAccueil=$dren_A[0]->nom_dren;

        /*
        $this->eleveInfo= eleve::where('eleves.id',$id)
        ->join('ecoles', 'eleves.ecole_id', '=', 'ecoles.id')
        ->join('drens', 'drens.code_dren','=','ecoles.CODE_DREN')
        ->get() ;

insert into `eleves` (`matricule`, `nom`, `prenom`, `classe`, `genre`, `tgp`, `mo`, `dateNaissance`, `contactParent`, `fichier`, `ecole_id`, `serie`, `updated_at`, `created_at`) values ('12387984Y', 'koffi ', 'antoine', '2nde', 'M', '23', '12', '2023-09-09', '', 'SksNqXj69xEPoF9fJuIHs32B6JIJ2vNPXGMDO7Aa.pdf', '3459', 'D', '2023-09-22 14:13:25', '2023-09-22 14:13:25')
---
            $validate['mo']=$this->mo;
        }
        if(!eleve::where('matricule', $this->matricule)->exists()){
            eleve::create($validate);

select * from `eleves` where `eleves`.`id` = '13'
---
    public function updateStudent(){
        $validate = $this->validate([
            'matricule'=>'required|min:6',
            'nom'=>'required|min:3',
            'prenom'=>'required|min:3',
            'classe'=>'required|min:3',
            'genre'=>'required|min:1',
            'tgp'=>'',
            'mo'=>'',
            'dateNaissance'=>'',
            'contactParent'=>'',
            'ecole_id' =>'required|min:1',
            'ecole_A' =>'required|min:1',
            'serie'=>'required|min:1',
            'fiche_id' =>'required|min:1',
        ]);
        if(!$this->classe=='2nde'){
            $validate['serie']=$this->serie;
            $validate['mo']=$this->mo;
        }
        $eleveupdate = eleve::find($this->id_eleve);

select * from `drens` where `drens`.`id` in (2, 3, 12, 17)
select * from `ecoles` where `ecoles`.`id` in (3, 5, 8, 26, 613, 3275)
select * from `ecoles` where `ecoles`.`id` in (3, 4, 228)
select * from `drens` where `drens`.`id` in (3, 12)
---
    public function render()
    {
        return view('livewire.student-index', [
            'students'=> eleve::where($this->orderField, 'LIKE', '%'.$this->search.'%')
            ->with('eleve_ecole_A')
            ->with('eleve_fiche')
            ->where('nom', 'LIKE', '%'.$this->nom.'%')
            ->where('prenom', 'LIKE', '%'.$this->prenom.'%')
            ->where('matricule', 'LIKE', '%'.$this->matricule.'%')
            ->where('dateNaissance', 'LIKE', '%'.$this->dateNaissance.'%')
            ->where('serie', 'LIKE', '%'.$this->serie.'%')
            ->where('classe', 'LIKE', '%'.$this->classe.'%')
            ->orderBy($this->orderField, $this->orderDirection)
            ->paginate(10),

            'ecole'=>ecole::select('id','NOMCOMPLs')->get(),
            'fiche'=> fiche::with('fiche_ecole')->with('fiche_dren')->get()

        ]);