app/Livewire/StudentIndex.php

select * from `eleves` where `eleves`.`id` = 10
select * from `drens` where `code_dren` = 40
select * from `ecoles` where `ecoles`.`id` in (3459)
---
    public function studentInfo($id){
        $this->eleveInfo = eleve::with('eleve_ecole')->where('eleves.id',$id)->get();
        $dren = dren::where('code_dren',$this->eleveInfo[0]['eleve_ecole']->CODE_DREN)->get();

select `id`, `NOMCOMPLs` from `ecoles`
---
    public function render()
    {
        return view('livewire.student-index', [
            'students'=> eleve::where($this->orderField, 'LIKE', '%'.$this->search.'%')
            ->orderBy($this->orderField, $this->orderDirection)
            ->paginate(10),

            'ecole'=>ecole::select('id','NOMCOMPLs')->get(),